{
  "class_name": "Model",
  "config": {
    "name": "DenseNet",
    "layers": [
      {
        "name": "input_1",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            32,
            32,
            5,
            1
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_1"
        },
        "inbound_nodes": []
      },
      {
        "name": "conv3d_1",
        "class_name": "Conv3D",
        "config": {
          "name": "conv3d_1",
          "trainable": true,
          "filters": 10,
          "kernel_size": [
            3,
            3,
            3
          ],
          "strides": [
            1,
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "input_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_1",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_1",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv3d_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_1",
        "class_name": "Activation",
        "config": {
          "name": "activation_1",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv3d_2",
        "class_name": "Conv3D",
        "config": {
          "name": "conv3d_2",
          "trainable": true,
          "filters": 14,
          "kernel_size": [
            3,
            3,
            3
          ],
          "strides": [
            1,
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_1",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_1",
          "trainable": true,
          "rate": 0.3,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "conv3d_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "concatenate_1",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_1",
          "trainable": true,
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "conv3d_1",
              0,
              0,
              {}
            ],
            [
              "dropout_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_2",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_2",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "concatenate_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_2",
        "class_name": "Activation",
        "config": {
          "name": "activation_2",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv3d_3",
        "class_name": "Conv3D",
        "config": {
          "name": "conv3d_3",
          "trainable": true,
          "filters": 14,
          "kernel_size": [
            3,
            3,
            3
          ],
          "strides": [
            1,
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_2",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_2",
          "trainable": true,
          "rate": 0.3,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "conv3d_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "concatenate_2",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_2",
          "trainable": true,
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "conv3d_1",
              0,
              0,
              {}
            ],
            [
              "dropout_1",
              0,
              0,
              {}
            ],
            [
              "dropout_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_3",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_3",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "concatenate_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_3",
        "class_name": "Activation",
        "config": {
          "name": "activation_3",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv3d_4",
        "class_name": "Conv3D",
        "config": {
          "name": "conv3d_4",
          "trainable": true,
          "filters": 14,
          "kernel_size": [
            3,
            3,
            3
          ],
          "strides": [
            1,
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_3",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_3",
          "trainable": true,
          "rate": 0.3,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "conv3d_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "concatenate_3",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_3",
          "trainable": true,
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "conv3d_1",
              0,
              0,
              {}
            ],
            [
              "dropout_1",
              0,
              0,
              {}
            ],
            [
              "dropout_2",
              0,
              0,
              {}
            ],
            [
              "dropout_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_4",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_4",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "concatenate_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_4",
        "class_name": "Activation",
        "config": {
          "name": "activation_4",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv3d_5",
        "class_name": "Conv3D",
        "config": {
          "name": "conv3d_5",
          "trainable": true,
          "filters": 52,
          "kernel_size": [
            1,
            1,
            1
          ],
          "strides": [
            1,
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_4",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_4",
          "trainable": true,
          "rate": 0.3,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "conv3d_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "average_pooling3d_1",
        "class_name": "AveragePooling3D",
        "config": {
          "name": "average_pooling3d_1",
          "trainable": true,
          "pool_size": [
            2,
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2,
            1
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "dropout_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_5",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_5",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "average_pooling3d_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_5",
        "class_name": "Activation",
        "config": {
          "name": "activation_5",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv3d_6",
        "class_name": "Conv3D",
        "config": {
          "name": "conv3d_6",
          "trainable": true,
          "filters": 14,
          "kernel_size": [
            3,
            3,
            3
          ],
          "strides": [
            1,
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_5",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_5",
          "trainable": true,
          "rate": 0.3,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "conv3d_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "concatenate_4",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_4",
          "trainable": true,
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "average_pooling3d_1",
              0,
              0,
              {}
            ],
            [
              "dropout_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_6",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_6",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "concatenate_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_6",
        "class_name": "Activation",
        "config": {
          "name": "activation_6",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv3d_7",
        "class_name": "Conv3D",
        "config": {
          "name": "conv3d_7",
          "trainable": true,
          "filters": 14,
          "kernel_size": [
            3,
            3,
            3
          ],
          "strides": [
            1,
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_6",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_6",
          "trainable": true,
          "rate": 0.3,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "conv3d_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "concatenate_5",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_5",
          "trainable": true,
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "average_pooling3d_1",
              0,
              0,
              {}
            ],
            [
              "dropout_5",
              0,
              0,
              {}
            ],
            [
              "dropout_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_7",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_7",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "concatenate_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_7",
        "class_name": "Activation",
        "config": {
          "name": "activation_7",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv3d_8",
        "class_name": "Conv3D",
        "config": {
          "name": "conv3d_8",
          "trainable": true,
          "filters": 14,
          "kernel_size": [
            3,
            3,
            3
          ],
          "strides": [
            1,
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_7",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_7",
          "trainable": true,
          "rate": 0.3,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "conv3d_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "concatenate_6",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_6",
          "trainable": true,
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "average_pooling3d_1",
              0,
              0,
              {}
            ],
            [
              "dropout_5",
              0,
              0,
              {}
            ],
            [
              "dropout_6",
              0,
              0,
              {}
            ],
            [
              "dropout_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_8",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_8",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "concatenate_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_8",
        "class_name": "Activation",
        "config": {
          "name": "activation_8",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv3d_9",
        "class_name": "Conv3D",
        "config": {
          "name": "conv3d_9",
          "trainable": true,
          "filters": 94,
          "kernel_size": [
            1,
            1,
            1
          ],
          "strides": [
            1,
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_8",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_8",
          "trainable": true,
          "rate": 0.3,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "conv3d_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "input_2",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            16,
            16,
            5,
            3
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_2"
        },
        "inbound_nodes": []
      },
      {
        "name": "average_pooling3d_2",
        "class_name": "AveragePooling3D",
        "config": {
          "name": "average_pooling3d_2",
          "trainable": true,
          "pool_size": [
            2,
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2,
            1
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "dropout_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv3d_21",
        "class_name": "Conv3D",
        "config": {
          "name": "conv3d_21",
          "trainable": true,
          "filters": 15,
          "kernel_size": [
            3,
            3,
            3
          ],
          "strides": [
            1,
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "input_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_9",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_9",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "average_pooling3d_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_21",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_21",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv3d_21",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_9",
        "class_name": "Activation",
        "config": {
          "name": "activation_9",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_21",
        "class_name": "Activation",
        "config": {
          "name": "activation_21",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_21",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv3d_10",
        "class_name": "Conv3D",
        "config": {
          "name": "conv3d_10",
          "trainable": true,
          "filters": 14,
          "kernel_size": [
            3,
            3,
            3
          ],
          "strides": [
            1,
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv3d_22",
        "class_name": "Conv3D",
        "config": {
          "name": "conv3d_22",
          "trainable": true,
          "filters": 14,
          "kernel_size": [
            3,
            3,
            3
          ],
          "strides": [
            1,
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_21",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_9",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_9",
          "trainable": true,
          "rate": 0.3,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "conv3d_10",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_20",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_20",
          "trainable": true,
          "rate": 0.3,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "conv3d_22",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "concatenate_7",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_7",
          "trainable": true,
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "average_pooling3d_2",
              0,
              0,
              {}
            ],
            [
              "dropout_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "concatenate_16",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_16",
          "trainable": true,
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "conv3d_21",
              0,
              0,
              {}
            ],
            [
              "dropout_20",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_10",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_10",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "concatenate_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_22",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_22",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "gamma_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.004999999888241291
            }
          },
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "concatenate_16",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_10",
        "class_name": "Activation",
        "config": {
          "name": "activation_10",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_10",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_22",
        "class_name": "Activation",
        "config": {
          "name": "activation_22",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_22",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv3d_11",
        "class_name": "Conv3D",
        "config": {
          "name": "conv3d_11",
          "trainable": true,
          "filters": 14,
          "kernel_size": [
            3,
            3,
            3
          ],
          "strides": [
            1,
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
